[
    {
        "id": 1,
        "title": "Booki",
        "thumbnail": "/assets/projects_thumbnails/booki_thumbnail.png",
        "description": {
            "fr-FR": "Mon rôle dans ce projet est d'intégrer l'interface du site web en utilisant du code HTML et CSS. Pour ce faire, je vais :\n\n1. Intégrer les maquettes du site pour les versions desktop, tablette et mobile.\n2. Utiliser les images fournies pour le site.\n3. Respecter les spécifications et contraintes techniques décrites dans la note de synthèse.",
            "en-US": "My role in this project is to integrate the website's interface using HTML and CSS. To achieve this, I will:\n\n1. Integrate the site's mockups for desktop, tablet, and mobile versions.\n2. Use the provided images for the site.\n3. Adhere to the technical specifications and constraints outlined in the summary note."
        },
        "tasks": {
            "fr-FR": [
                "Intégrer une page web à partir d'une maquette",
                "Utilisation de grid et flexbox",
                "Layout en responsive design"
            ],
            "en-US": [
                "Integrating a web page from a mockup",
                "Utilizing grid and flexbox",
                "Responsive design layout"
            ]
        },        
        "repo": "https://github.com/MaximeZind/P2-Booki",
        "preview": "URL_de_la_prévisualisation",
        "mockup": "URL_de_la_maquette",
        "stack": [
            "HTML",
            "CSS"
        ],
        "type": "Openclassrooms",
        "dateOfCreation": "2022-12-02"
    },
    {
        "id": 2,
        "title": "Oh My Food",
        "thumbnail": "/assets/projects_thumbnails/ohmyfood_thumbnail.png",
        "description": {
            "fr-FR": "Ma mission consiste à développer un site web \"mobile first\" pour Ohmyfood. Ce site répertoriera les menus de restaurants gastronomiques à Paris, offrant aux clients la possibilité de composer leur menu et de réduire les temps d'attente. Les maquettes mobile et desktop ont été fournies, incluant des animations, ainsi que les ressources du site (images et textes). Le site doit être responsive, privilégier le mobile, et inclure des animations soignées. Mon travail est de suivre les directives du brief créatif, en expliquant le fonctionnement des animations à l'équipe. L'objectif est de livrer un site pleinement fonctionnel conformément aux spécifications.",
            "en-US": "My mission is to develop a 'mobile first' website for Ohmyfood. This site will list menus from gourmet restaurants in Paris, offering customers the option to create their menu and reduce waiting times. Mobile and desktop mockups, including animations, and site resources (images and text) have been provided. The site should be responsive, prioritize mobile, and include polished animations. My task is to follow the guidelines in the creative brief and explain how the animations work to the team. The goal is to deliver a fully functional site in accordance with the specifications."
        },
        "tasks": {
            "fr-FR": [
                "Intégrer une page web à partir d'une maquette",
                "Layout en responsive design",
                "Animations CSS",
                "Animation de chargement",
                "Mobile first"
            ],
            "en-US": [
                "Integrating a web page from a mockup",
                "Responsive design layout",
                "CSS animations",
                "Loading animation",
                "Mobile-first approach"
            ]
        },
        "repo": "https://github.com/MaximeZind/P3-OhMyFood",
        "preview": "https://maximezind.github.io/P3-OhMyFood/",
        "mockup": null,
        "stack": [
            "HTML",
            "CSS"
        ],
        "type": "Openclassrooms",
        "dateOfCreation": "2022-12-22"
    },
    {
        "id": 3,
        "title": "GameOn",
        "thumbnail": "/assets/projects_thumbnails/gameon_thumbnail.png",
        "description": {
            "fr-FR": "Le projet implique la finalisation du développement Front-End d'une page d'accueil et d'un formulaire d'inscription pour GameOn. Lors du projet initial, certaines parties du code n'ont pas été achevées. Mon rôle est de compléter le code JavaScript manquant en suivant les directives fournies dans le dépôt GitHub. Le code doit être organisé en utilisant des fichiers distincts pour le HTML, le CSS et le JavaScript, et des tests manuels devront être effectués pour garantir le bon fonctionnement des fonctionnalités, des entrées de formulaire, et de l'affichage responsive. Une fois le travail terminé, le code sera revu pour s'assurer qu'il est prêt à être déployé.",
            "en-US": "The project involves completing the Front-End development of a homepage and registration form for GameOn. During the initial project, certain parts of the code were left unfinished. My role is to complete the missing JavaScript code by following the guidelines provided in the GitHub repository. The code should be organized using separate files for HTML, CSS, and JavaScript, and manual testing will be required to ensure the proper functioning of features, form inputs, and responsive display. Once the work is finished, the code will be reviewed to ensure it is ready for deployment."
        },
        "tasks": {
            "fr-FR": [
                "Création d'une landing page",
                "Layout en responsive design",
                "Validation d'un formulaire en JavaScript"
            ],
            "en-US": [
                "Creating a landing page",
                "Responsive design layout",
                "JavaScript form validation"
            ]
        },
        "repo": "https://github.com/MaximeZind/P4-GameOn",
        "preview": "https://maximezind.github.io/P4-GameOn/",
        "mockup": "https://www.figma.com/file/B7NKBDvSI18uoMLJgpnh48/UI-Design-GameOn-FR?type=design&node-id=0-1&mode=design&t=92NB7bNsh5aNHQN1-0",
        "stack": [
            "HTML",
            "CSS",
            "JS"
        ],
        "type": "Openclassrooms",
        "dateOfCreation": "2023-01-12"
    },
    {
        "id": 4,
        "title": "FishEye",
        "thumbnail": "/assets/projects_thumbnails/fisheye_thumbnail.png",
        "description": {
            "fr-FR": "Je suis chargé de développer le premier prototype du projet FishEye. L'objectif est de construire un prototype fonctionnel du nouveau site web. Je vais devoir fournir tout le HTML, le CSS et le JavaScript nécessaires pour ce prototype. Pour démarrer, voici les informations dont je dispose :\n\n- Des notes de réunion détaillant les principales fonctionnalités et les exigences techniques à implémenter.\n- Les maquettes approuvées pour la page principale et les pages d'informations de chaque photographe de l'échantillon.\n- Des exemples de photos et de vidéos de FishEye à utiliser pour la conception des pages.\n- Des exemples de données au format JSON pour créer dynamiquement les pages des photographes.\nLe site web doit être un prototype qui correspond aux maquettes et qui fonctionne correctement, sans erreurs dans la console. L'accessibilité est une priorité absolue pour le client, donc je veillerai à construire le site conformément aux exigences d'accessibilité mentionnées dans les notes de réunion. Une fois que j'aurai terminé, je soumettrai le repo GitHub avec le code complet. Amanda and moi passerons en revue toutes les fonctionnalités des pages, et je devrai également effectuer une démonstration de la navigation au clavier pour garantir l'accessibilité.",
            "en-US": "I am tasked with developing the first prototype of the FishEye project. The goal is to build a functional prototype of the new website. I will need to provide all the HTML, CSS, and JavaScript necessary for this prototype. To get started, here is the information I have:\n\n- Detailed meeting notes outlining the main features and technical requirements to be implemented.\n- Approved mockups for the main page and information pages for each photographer in the sample.\n- Examples of photos and videos from FishEye to use for page design.\n- Examples of data in JSON format to dynamically create photographer pages.\nThe website should be a prototype that matches the mockups and functions correctly, with no errors in the console. Accessibility is a top priority for the client, so I will ensure the site is built in compliance with the accessibility requirements mentioned in the meeting notes. Once I've finished, I will submit the GitHub repository with the complete code. Amanda and I will review all the page features, and I will also need to demonstrate keyboard navigation to ensure accessibility."
        },
        "tasks": {
            "fr-FR": [
                "Intégrer une page web à partir d'une maquette",
                "Layout en responsive design",
                "Fetch des données via des fonctions asynchrones",
                "Attention particulière à l'accessibilité",
                "Design factory en JavaScript"
            ],
            "en-US": [
                "Integrating a web page from a mockup",
                "Responsive design layout",
                "Fetching data through asynchronous functions",
                "Special focus on accessibility",
                "JavaScript design factory"
            ]
        },
        "repo": "https://github.com/MaximeZind/P6-Front-End-Fisheye",
        "preview": "https://maximezind.github.io/P6-Front-End-Fisheye/",
        "mockup": "https://www.figma.com/file/Q3yNeD7WTK9QHDldg9vaRl/UI-Design-FishEye-FR?type=design&node-id=0-1&mode=design&t=oglFNwK5RSWTI8S5-0",
        "stack": [
            "HTML",
            "CSS",
            "JS"
        ],
        "type": "Openclassrooms",
        "dateOfCreation": "2023-02-03"
    },
    {
        "id": 5,
        "title": "Les Petits Plats",
        "thumbnail": "/assets/projects_thumbnails/lespetitsplats_thumbnail.png",
        "description": {
            "fr-FR": "L'objectif du projet est de créer un site web de recettes de cuisine. Ma première tâche est d'implémenter la fonctionnalité de recherche, en utilisant un fichier JavaScript contenant un tableau JSON de 50 recettes. Je dois également m'assurer de respecter la maquette de la page, en me basant sur le design fourni. Le site doit offrir une recherche rapide et fluide, car l'accessibilité est une priorité pour les utilisateurs. Mon travail sera transmis à l'équipe Back-end ultérieurement, donc je dois rédiger un document expliquant en détail mon travail pour leur adaptation. En parallèle, je dois réaliser deux implémentations différentes de la fonctionnalité de recherche, en utilisant les boucles natives et la programmation fonctionnelle avec les méthodes de l'objet array. Pour cela, je remplirai un document de comparaison appelé 'fiche d'investigation de fonctionnalité'. Après avoir planifié ces deux versions, je les implémenterai sur deux branches Git distinctes, en veillant à respecter les bonnes pratiques de codage. Enfin, je dois tester les performances des deux implémentations à l'aide d'un outil de comparaison de performance pour choisir la meilleure.",
            "en-US": "The objective of the project is to create a recipe website. My first task is to implement the search functionality using a JavaScript file containing a JSON array of 50 recipes. I also need to ensure that I follow the page layout based on the provided design. The website should provide a quick and smooth search experience as accessibility is a top priority for users. My work will be passed on to the Back-end team later, so I need to write a detailed document explaining my work for their adaptation. In parallel, I need to create two different implementations of the search functionality using native loops and functional programming with array object methods. For this, I will fill out a comparison document called 'feature investigation sheet.' After planning these two versions, I will implement them on two separate Git branches, ensuring that I follow coding best practices. Finally, I need to test the performance of both implementations using a performance comparison tool to choose the best one."
        },
        "tasks": {
            "fr-FR": [
                "Intégrer une page web à partir d'une maquette",
                "Mise en page en responsive design",
                "Récupération de données via des fonctions asynchrones",
                "Création d'une factory de design en JavaScript",
                "Implémentation d'un algorithme de recherche"
            ],
            "en-US": [
                "Integrating a web page from a mockup",
                "Responsive design layout",
                "Fetching data through asynchronous functions",
                "Creating a JavaScript design factory",
                "Implementing a search algorithm"
            ]
        },
        "repo": "https://github.com/MaximeZind/P7-front-end-search-engine",
        "preview": "https://maximezind.github.io/P7-front-end-search-engine/",
        "mockup": "https://www.figma.com/file/xqeE1ZKlHUWi2Efo8r73NK/UI-Design-Les-Petits-Plats-FR?type=design&node-id=0-1&mode=design&t=w8biGSyvV00v93et-0",
        "stack": [
            "HTML",
            "CSS",
            "JS"
        ],
        "type": "Openclassrooms",
        "dateOfCreation": "2023-02-24"
    },
    {
        "id": 6,
        "title": "Billed",
        "thumbnail": "/assets/projects_thumbnails/billed_thumbnail.png",
        "description": {
            "fr-FR": "Je dois effectuer les tâches suivantes dans le cadre de la fonctionnalité 'note de frais' pour Billed :\n\nTravailler sur le parcours employé : Je dois examiner et déboguer le front-end du parcours employé, en m'assurant qu'il fonctionne correctement.\nRésoudre les bugs : Je dois identifier et corriger tous les bugs, problèmes ou erreurs qui affectent la fonctionnalité, en m'aidant des rapports de bugs disponibles.\nMettre en place des tests manquants : Je devrai ajouter des tests pour garantir le bon fonctionnement de la fonctionnalité. Cela peut inclure des tests unitaires, des tests d'intégration ou des tests End-to-End.\nAméliorer la fiabilité : Mon objectif est d'assurer la fiabilité de la fonctionnalité en vérifiant son fonctionnement dans divers scénarios et en m'assurant qu'elle répond aux besoins des utilisateurs.\nInstaller le back-end et le front-end : Je devrai suivre les instructions fournies dans les repositories correspondants pour installer à la fois le back-end et le front-end, de manière à ce que l'ensemble de la fonctionnalité puisse être testé et évalué.",
            "en-US": "I have the following tasks to perform as part of the 'expense note' feature for Billed:\n\nWork on the employee journey: I need to review and debug the front-end of the employee journey, ensuring that it functions correctly.\nResolve bugs: I must identify and fix all bugs, issues, or errors that affect the feature, using available bug reports as a guide.\nImplement missing tests: I will need to add tests to ensure the proper functioning of the feature. This may include unit tests, integration tests, or End-to-End tests.\nEnhance reliability: My goal is to ensure the reliability of the feature by checking its performance in various scenarios and ensuring it meets user needs.\nInstall the back-end and front-end: I will need to follow the provided instructions in the respective repositories to install both the back-end and front-end, so that the entire feature can be tested and evaluated."
        },
        "tasks": {
            "fr-FR": [
                "Correction de bugs dans une application mal codée",
                "Implémentation de tests unitaires avec Jest",
                "Élaboration d'un plan pour les tests End2End"
            ],
            "en-US": [
                "Fixing bugs in a poorly coded application",
                "Setting up unit tests with Jest",
                "Creating a plan for End2End tests"
            ]
        },
        "repo": "https://github.com/MaximeZind/P9-Billed-app",
        "preview": null,
        "mockup": null,
        "stack": [
            "HTML",
            "CSS",
            "JS",
            "Jest"
        ],
        "type": "Openclassrooms",
        "dateOfCreation": "2023-04-21"
    },
    {
        "id": 7,
        "title": "Learn@Home",
        "thumbnail": "/assets/projects_thumbnails/learn@home_thumbnail.png",
        "description": {
            "fr-FR": "Je dois gérer un nouveau projet pour Learn@Home, une association qui souhaite développer un site web pour faciliter la communication entre les élèves en difficulté scolaire et les tuteurs bénévoles. Mon rôle est de cadrer le projet et de coordonner les développements avec mon équipe. Les étapes à suivre sont les suivantes :\n\n1. Définir les besoins client en concevant les diagrammes de cas d'usage pour chaque fonctionnalité majeure de chaque page (connexion, chat, calendrier, gestionnaire de tâches, tableau de bord).\n2. Élaborer des user stories avec les critères d'acceptation pour chaque fonctionnalité, dans un format standard (PDF, DOCX, XLSX).\n3. Créer des maquettes du site avec un design simple, en fournissant au moins une maquette par page et en expliquant la navigation entre les pages.\n4. Mettre en place un Kanban pour découper le projet en blocs de fonctionnalités et sous-fonctionnalités, en utilisant un modèle déjà initié sur Notion.",
            "en-US": "I have to manage a new project for Learn@Home, an association that wants to develop a website to facilitate communication between students in need of academic support and volunteer tutors. My role is to define the client's needs by designing use case diagrams for each major feature of each page (login, chat, calendar, task manager, dashboard). I need to develop user stories with acceptance criteria for each feature in a standard format (PDF, DOCX, XLSX). I will create website mock-ups with a simple design, providing at least one mock-up per page and explaining the navigation between pages. Additionally, I will set up a Kanban board to break down the project into feature blocks and sub-features, using a template already initiated on Notion."
        },
        "tasks": {
            "fr-FR": [
                "Diagrammes de cas d'usage",
                "User Stories pour chaque fonctionnalité",
                "Maquette du site avec Figma",
                "Mise en place du Kanban en découpant le projet"
            ],
            "en-US": [
                "Use case diagrams",
                "User Stories for each feature",
                "Site wireframe with Figma",
                "Setting up Kanban by breaking down the project"
            ]
        },
        "repo": null,
        "preview": null,
        "mockup": "URL_de_la_maquette",
        "stack": [
            "Figma"
        ],
        "type": "Openclassrooms",
        "dateOfCreation": "2023-05-12"
    },
    {
        "id": 8,
        "title": "Kasa",
        "thumbnail": "/assets/projects_thumbnails/kasa_thumbnail.png",
        "description": {
            "fr-FR": "Mon objectif est de développer les composants React et les routes avec React Router en suivant les maquettes Figma. Je dois garantir la qualité du code et travailler sans back-end pour le moment. Je suis chargé de respecter les coding guidelines de Kasa, tout en ayant la flexibilité d'utiliser un autre bundler que Create React App. Le design est basé sur les maquettes Figma, avec des composants structurés pour faciliter le développement React. En ce qui concerne les fonctionnalités, je dois suivre les instructions spécifiques pour la galerie d'images et les Collapse.",
            "en-US": "My goal is to develop React components and routes using React Router according to the Figma mock-ups. I must ensure code quality and work without a back-end for now. I'm responsible for adhering to Kasa's coding guidelines while having the flexibility to use a bundler other than Create React App if preferred. The design is based on Figma mock-ups with structured components to streamline React development. Regarding features, I need to follow specific instructions for image galleries and Collapse components."
        },
        "tasks": {
            "fr-FR": [
                "Création d'une application React",
                "Logique de composants réutilisables",
                "Routage avec React Router Dom",
                "Création d'un carousel"
            ],
            "en-US": [
                "Creating a React application",
                "Logic for reusable components",
                "Routing with React Router Dom",
                "Creating a carousel"
            ]
        },
        "repo": "https://github.com/MaximeZind/P11-Kasa-Platform",
        "preview": "https://p11-kasa-platform-maxime-zindersteins-projects.vercel.app/",
        "mockup": "https://www.figma.com/file/qEno0LwL4ZLkWyeY59kxp1/UI-Design-Kasa-FR?type=design&node-id=0-1&mode=design",
        "stack": [
            "HTML",
            "CSS",
            "JS",
            "React"
        ],
        "type": "Openclassrooms",
        "dateOfCreation": "2023-06-30"
    },
    {
        "id": 9,
        "title": "SportSee",
        "thumbnail": "/assets/projects_thumbnails/sportsee_thumbnail.png",
        "description": {
            "fr-FR": "Pour la réalisation de la fonctionnalité \"profil utilisateur\" chez SportSee, voici les tâches à accomplir :\n\n1. Développer la nouvelle page profil utilisateur en utilisant React.\n2. Intégrer les graphiques relatifs à l'activité sportive, en choisissant entre D3 ou Recharts, avec une attention particulière à D3.\n3. Se concentrer sur l'intégration CSS de la version desktop de la page.\n4. Garantir que la page est lisible sur des écrans d'au moins 1024 par 780 pixels.\n5. Gérer les appels HTTP depuis un backend NodeJS préparé par l'équipe, en utilisant Fetch ou Axios en dehors des composants React.\n6. Créer un mock des données de l'API pour normaliser le schéma de données avant l'intégration.\n7. Documenter le projet avec un Readme, JSDoc ou des proptypes pour faciliter la collaboration au sein de l'équipe.\n\nL'objectif global est de développer une page profil fonctionnelle et de qualité, en se concentrant sur les fonctionnalités de la partie TODO du sprint actuel. La page permettra aux utilisateurs de suivre le nombre de sessions et de calories brûlées, contribuant ainsi à l'amélioration de l'expérience utilisateur sur le site de SportSee.",
            "en-US": "For the implementation of the \"user profile\" feature at SportSee, the following tasks need to be completed:\n\n1. Develop the new user profile page using React.\n2. Integrate charts related to the user's sports activities, choosing between D3 or Recharts, with a specific focus on D3.\n3. Concentrate on desktop CSS integration for the page.\n4. Ensure the page is readable on screens with a minimum resolution of 1024 by 780 pixels.\n5. Manage HTTP requests from a NodeJS backend provided by the team, using either Fetch or Axios outside of React components.\n6. Create a mock of API data to standardize the data schema before integration.\n7. Document the project with a Readme, JSDoc, or propTypes to facilitate team collaboration.\n\nThe overall goal is to develop a functional and high-quality user profile page, with a focus on the TODO features for the current sprint. The page will allow users to track the number of sessions and calories burned, thus improving the user experience on the SportSee website."
        },
        "tasks": {
            "fr-FR": [
                "Création d'une table d'analytics avec React",
                "Récupération des données du backend via axios",
                "Utilisation de Recharts pour les graphiques",
                "Modélisation des données via une classe 'utilisateur'"
            ],
            "en-US": [
                "Creating an analytics table with React",
                "Retrieving backend data using axios",
                "Using Recharts for charting",
                "Data modeling using a 'user' class"
            ]
        },
        "repo": "https://github.com/MaximeZind/P12-SportSee",
        "preview": null,
        "mockup": "https://www.figma.com/file/BMomGVZqLZb811mDMShpLu/UI-design-Sportify-FR?type=design&node-id=0-1&mode=design&t=KnNAlouNvsN36fGr-0",
        "stack": [
            "HTML",
            "CSS",
            "JS",
            "React"
        ],
        "type": "Openclassrooms",
        "dateOfCreation": "2023-08-04"
    },
    {
        "id": 10,
        "title": "Argent Bank",
        "thumbnail": "/assets/projects_thumbnails/argentbank_thumbnail.png",
        "description": {
            "fr-FR": "Je dois effectuer les tâches suivantes dans le cadre de la fonctionnalité 'note de frais' pour Argent Bank :\nDévelopper une Application Web Réactive : Le principal objectif de la phase 1 du projet consiste à créer une application web complète et réactive en utilisant React. Le projet débute avec des fichiers HTML statiques et des styles CSS pour la page d'accueil, la page de connexion et la page de profil.\nGérer l'État avec Redux : L'application doit utiliser Redux pour gérer l'état de l'ensemble de l'application, garantissant une expérience utilisateur fluide.\nFonctionnalités d'Authentification : L'application doit permettre aux utilisateurs de visiter la page d'accueil, de se connecter, de se déconnecter, d'accéder à leur profil après une connexion réussie, et de mettre à jour leurs profils tout en conservant les données dans la base de données.\nIntégration de l'API Backend : L'équipe back-end a déjà créé toutes les API nécessaires, et vous devrez les intégrer. La documentation Swagger est fournie pour vous guider.\nPrise en Charge de la Phase 2 : Bien que la phase 2, concernant les transactions, soit en cours de conception, votre avis sera sollicité pour modéliser les API back-end nécessaires. Vous devrez fournir un document décrivant ces API, en suivant les directives Swagger.\nCollaboration et Revue de Code : Tout au long du projet, une collaboration étroite avec l'équipe d'Argent Bank sera essentielle, y compris des révisions de code et des discussions sur les propositions d'API.\nL'objectif global est de livrer une application web réactive de haute qualité pour l'authentification des utilisateurs, tout en contribuant à la conception des API nécessaires pour la phase 2 du projet.",
            "en-US": "I need to perform the following tasks as part of the 'expense note' feature for Argent Bank:\nDevelop a Responsive Web Application: The main goal of phase 1 of the project is to create a complete and responsive web application using React. The project starts with static HTML files and CSS styles for the homepage, login page, and profile page.\nManage State with Redux: The application must use Redux to manage the state of the entire application, ensuring a smooth user experience.\nAuthentication Features: The application should allow users to visit the homepage, log in, log out, access their profile after a successful login, and update their profiles while retaining data in the database.\nBackend API Integration: The backend team has already created all the necessary APIs, and you will need to integrate them. Swagger documentation is provided to guide you.\nSupport for Phase 2: Although phase 2, concerning transactions, is still in the design phase, your input will be sought to model the necessary backend APIs. You will need to provide a document describing these APIs, following Swagger guidelines.\nCollaboration and Code Review: Throughout the project, close collaboration with the Argent Bank team will be essential, including code reviews and discussions on API proposals.\nThe overall goal is to deliver a high-quality responsive web application for user authentication while contributing to the design of the APIs needed for phase 2 of the project."
        },
        "tasks": {
            "fr-FR": [
                "State globaux avec Redux",
                "Connection au compte via l'API (avec token)",
                "Documentation de la seconde partie de l'API pour les transactions"
            ],
            "en-US": [
                "Global state management with Redux",
                "Connecting to the account through the API (with a token)",
                "Documenting the second part of the API for transactions"
            ]
        },
        "repo": "https://github.com/MaximeZind/P13-Bank-API",
        "preview": null,
        "mockup": null,
        "stack": [
            "HTML",
            "CSS",
            "JS",
            "React",
            "Redux"
        ],
        "type": "Openclassrooms",
        "dateOfCreation": "2023-08-25"
    },
    {
        "id": 11,
        "title": "HRNet",
        "thumbnail": "/assets/projects_thumbnails/hrnet_thumbnail.png",
        "description": {
            "fr-FR": "Je dois entreprendre les tâches suivantes dans le cadre du projet de refonte d'HRnet pour WealthHealth :\n\nConversion du projet HRNet en React :\n\n- Convertir l'ensemble du projet HRNet en React, y compris les pages \"Create Employee\" et \"Employee List.\"\n- Implémenter un système de gestion d'état (l'ancienne version utilise un stockage local).\n- Assurer la cohérence du style, avec la possibilité d'améliorer le design si le temps le permet.\n- Effectuer des tests unitaires si possible, sinon, des tests manuels.\n\nConversion des plugins jQuery :\n\n- Convertir l'un des quatre plugins jQuery actuels en React.\n- Remplacer les trois autres plugins jQuery par des composants React, soit en les développant vous-même, soit en les important depuis des bibliothèques existantes si nécessaire.\n\nTests de performance :\n\n- Effectuer des audits de performance Lighthouse pour mesurer des données quantifiables telles que le temps de chargement des pages et les appels réseau.\n- Réaliser un audit de performance pour l'application HRNet jQuery actuelle, puis un autre pour l'application et le plugin jQuery converti en React.\n\nRespecter le paradigme de programmation fonctionnelle en utilisant React, en évitant les classes, en écrivant des morceaux de code modulaires, et en fournissant une documentation complète pour les composants React convertis.\n\nLe but ultime de ce projet est de créer une version 100% React de l'application HRnet, en remplaçant les plugins jQuery problématiques par des composants React pour améliorer les performances et la stabilité. Une fois que tout est terminé, je publierai le composant React sur npm ou un paquet GitHub pour une utilisation future.\n\nCes étapes contribueront à éliminer la dette technologique associée à HRnet et à fournir une application plus performante et facilement maintenable pour WealthHealth.",
            "en-US": "I must undertake the following tasks as part of the HRnet redesign project for WealthHealth:\n\nConversion of the HRNet project to React:\n\n- Convert the entire HRNet project to React, including the 'Create Employee' and 'Employee List' pages.\n- Implement a state management system (the old version uses local storage).\n- Ensure style consistency, with the possibility of improving the design if time allows.\n- Perform unit tests if possible, or manual tests if not.\n\nConversion of jQuery plugins:\n\n- Convert one of the four current jQuery plugins to React.\n- Replace the remaining three jQuery plugins with React components, either by developing them yourself or by importing them from existing libraries if necessary.\n\nPerformance testing:\n\n- Conduct Lighthouse performance audits to measure quantifiable data such as page loading times and network calls.\n- Perform a performance audit for the current jQuery-based HRNet application, and another one for the application after the jQuery plugin conversion to React.\n\nAdhere to the functional programming paradigm using React, avoiding classes, writing modular code, and providing comprehensive documentation for the converted React components.\n\nThe ultimate goal of this project is to create a 100% React version of the HRnet application, replacing problematic jQuery plugins with React components to improve performance and stability. Once everything is completed, I will publish the React component on npm or a GitHub package for future use.\n\nThese steps will help eliminate the technological debt associated with HRnet and provide a more performant and easily maintainable application for WealthHealth."
        },
        "tasks": {
            "fr-FR": [
                "Refonte complète d'une ancienne application jQuery",
                "Création et publication de 4 plugins sur npm",
                "Tests de performance avec LightHouse",
                "Tests End2End avec Cypress"
            ],
            "en-US": [
                "Complete overhaul of an old JQuery application",
                "Creation and publication of 4 plugins on npm",
                "Performance testing using LightHouse",
                "End-to-End testing with Cypress"
            ]
        },
        "repo": "https://github.com/MaximeZind/P14-Wealth_Health",
        "preview": "https://p14-wealth-health-maxime-zindersteins-projects.vercel.app/",
        "mockup": null,
        "stack": [
            "HTML",
            "CSS",
            "JS",
            "React",
            "Redux",
            "Cypress"
        ],
        "type": "Openclassrooms",
        "dateOfCreation": "2023-10-27"
    },
    {
        "id": 12,
        "title": "Portfolio",
        "thumbnail": "/assets/projects_thumbnails/portfolio_thumbnail.png",
        "description": {
            "fr-FR": "Ma formation d'un an avec Openclassrooms touchant à son terme, j'ai réfléchi à quel projet créer. Quoi de mieux qu'un portfolio, regroupant tous les projets sur lesquels j'ai travailler, pour illustrer une année d'efforts qui porte ses fruits? J'ai créé le design et ajouté des fonctionnalités au fur et à mesure. Je me suis plus ou moins servi de ce projet comme d'un terrain de jeu (notamment pour la partie avec l'effet de parallax). J'ai pris beaucoup de plaisir à le créer, j'espère que vous en aurez à l'explorer.",
            "en-US": "As my year long course with Openclassrooms is coming to an end, I've been thinking about what project to create. What could be better than a portfolio, gathering all the projects I've worked on, to illustrate a year of efforts bearing fruit? I designed it and added features gradually. I used this project more or less as a playground (especially for the part with the parallax effect). I greatly enjoyed creating it, and I hope you will enjoy exploring it."
        },
        "tasks": {
            "fr-FR": [
                "Construction d'un site web complet de A à Z",
                "Choix du design",
                "Création des svg, avec un effet de parallax",
                "Bonnes performances - selon LightHouse", 
                "Hébergement et déploiement du site en ligne"
            ],
            "en-US": [
                "Building a complete website from scratch",
                "Design choices",
                "Creation of SVGs with a parallax effect",
                "Optimizing for performance - according to LightHouse",
                "Hosting and deploying the site online"
            ]
        },
        "repo": "https://github.com/MaximeZind/portfolio",
        "preview": "https://www.maximezinderstein.com/",
        "mockup": null,
        "stack": [
            "HTML",
            "CSS",
            "JS",
            "React",
            "Redux"
        ],
        "type": "Personnal Projects",
        "dateOfCreation": "2023-11-07"
    }
]